# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'stow'
brew 'awscli'
brew 'bat' # "cat" on steroids
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew "mas"
brew "gpg"
brew 'httpie'
brew 'mackup'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew "the_silver_searcher" # Code search https://github.com/ggreer/the_silver_searcher
brew "wifi-password" #quicky get wifi password
brew "pandoc"

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'lepton'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'java7'
cask 'java8'
cask 'java11'
cask 'mysqlworkbench'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask "authy" #2FA
cask "notion"

# Quicklook [old mac feature alternative to check size]
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'


mas "Kindle", id: 405399194
mas "Xcode", id: 497799835
mas "Cleaner-App", id: 1013897218
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "iMovie", id:408981434